# -- coding: utf-8 --

FORCE_JIUXIPAI = \
    {"name": "九溪派",
     "titles": ["掌门", "首徒", "弟子", "新进弟子"]
     "description": ["位于杭州狮子峰下的小门派，因其在九溪傍筑有浣花庐，江湖上又称之为浣花门。",
                     "九溪派武学以剑法为主，奇门、暗器亦有所兼顾。其中越女剑法为九溪派绝学，但因为该派常年隐居不出，以致名声日益埋没。",
                     "九溪派数十年来只招女子入门，现任掌门为穆双清。"]}


FORCE_BEICHENPAI = \
    {"name": "北辰派",
     "titles": ["首徒", "次徒", "弟子", "新进弟子"]
     "description": ["姑苏城门派，创始人为剑法名家商河洛。十五年前，商河洛以一套西河剑法在华山大会上大放异彩，由此创立北辰派。",
                     "商河洛本人除武学外亦好读书，因此建造了天柱阁与北极阁搜罗天下典籍。",
                     "数年前商河洛去世，门下只有陈挺之、骆逸两名弟子，二人商议后决定不设掌门之位，陈挺之以北辰派首徒身份代行掌门之职。",
                     "北辰派武学以剑法为主，虽然人数不众，但凭借西河剑法与北辰双阁之名，在江湖上有较高威望。"]}
